Report/SpectrumAPIFrameWorkV3/SpectrumAPIFrameWork/Data/TemplateRequest/SOAP/Cust-Details-Case1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:cust="http://www.example.org/Cust-Details1">
   <soapenv:Header/>
   <soapenv:Body>
      <cust:EmpRequest>
         <cust:EmpId>${EmpId}$</cust:EmpId>
      </cust:EmpRequest>
   </soapenv:Body>
</soapenv:Envelope>